In [1]:
import numpy as np
import pandas as pd

#### **Pivot Tables**

a Pivot Table is a tool used to summarize, sort, reorganize, group, count, total, or average data stored in a table. It allows you to transform "long" data into a "wide" format to see relationships between variables clearly.

In [6]:
data = {
    'Date': pd.date_range('2026-01-01', periods=20),
    'Product': ['A', 'B', 'C', 'D'] * 5,
    'Region': ['East', 'West', 'North', 'South', 'East', 'West', 'North', 'South', 'East', 'West',
               'North', 'South', 'East', 'West', 'North', 'South', 'East', 'West', 'North', 'South'],
    'Sales': np.random.randint(100, 1000, 20),
    'Units': np.random.randint(10, 100, 20),
    'Rep': ['John', 'Mary', 'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice', 'John', 'Mary',
            'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice']
}

df=pd.DataFrame(data)

df['Month'] = df['Date'].dt.month_name()
df['Quarter'] = 'Q' + df['Date'].dt.quarter.astype(str)
df

         Date Product Region  Sales  Units    Rep    Month Quarter
0  2026-01-01       A   East    591     75   John  January      Q1
1  2026-01-02       B   West    232     25   Mary  January      Q1
2  2026-01-03       C  North    733     81    Bob  January      Q1
3  2026-01-04       D  South    675     68  Alice  January      Q1
4  2026-01-05       A   East    961     90   John  January      Q1
5  2026-01-06       B   West    843     93   Mary  January      Q1
6  2026-01-07       C  North    805     30    Bob  January      Q1
7  2026-01-08       D  South    755     77  Alice  January      Q1
8  2026-01-09       A   East    791     84   John  January      Q1
9  2026-01-10       B   West    647     10   Mary  January      Q1
10 2026-01-11       C  North    189     49    Bob  January      Q1
11 2026-01-12       D  South    359     58  Alice  January      Q1
12 2026-01-13       A   East    678     64   John  January      Q1
13 2026-01-14       B   West    418     86   Mary  January      Q1
14 2026-01-15       C  North    899     35    Bob  January      Q1
15 2026-01-16       D  South    241     99  Alice  January      Q1
16 2026-01-17       A   East    608     25   John  January      Q1
17 2026-01-18       B   West    889     82   Mary  January      Q1
18 2026-01-19       C  North    513     48    Bob  January      Q1
19 2026-01-20       D  South    786     17  Alice  January      Q1

In [ ]:
pivot1=pd.pivot_table(df,values='Sales',index='Region',columns='Product',aggfunc='median')

Product      A      B      C      D
Region
East     678.0    NaN    NaN    NaN
North      NaN    NaN  733.0    NaN
South      NaN    NaN    NaN  675.0
West       NaN  647.0    NaN    NaN

In [14]:
pivot2=pd.pivot_table(df,values=['Sales','Units'],index='Region' ,columns='Product',aggfunc="median")
pivot2

         Sales                      Units
Product      A      B      C      D     A     B     C     D
Region
East     678.0    NaN    NaN    NaN  75.0   NaN   NaN   NaN
North      NaN    NaN  733.0    NaN   NaN   NaN  48.0   NaN
South      NaN    NaN    NaN  675.0   NaN   NaN   NaN  68.0
West       NaN  647.0    NaN    NaN   NaN  82.0   NaN   NaN

#### **Cross Tabs**

a Crosstab (short for Cross Tabulation) is a specific type of pivot table used to show the frequency distribution of variables. While a pivot table can calculate sums or averages, a crosstab is primarily used to count how many times combinations of categories occur.

In [16]:
pd.crosstab(df['Region'],df['Product'])

Product  A  B  C  D
Region
East     5  0  0  0
North    0  0  5  0
South    0  0  0  5
West     0  5  0  0